Hi Vincent, thank you for the review.
I have below few points which I want to discuss- 

- The second apply is touching the key protect rule because there are changes in the FScloud example (current working branch) and due to this updates are being applied to the KMS rule.

- From main branch we are setting the `custom_rule_contexts_by_service` as below from `main` branch
   

    ```
    custom_rule_contexts_by_service = {
        "kms" = [{
          endpointType      = "private"
          service_ref_names = ["databases-for-mongodb", "databases-for-postgresql"]
          },
          {
            endpointType      = "public"
            service_ref_names = ["schematics"]
          },
          {
            endpointType = "public"
          zone_ids = [module.cbr_zone_operator_ips.zone_id] }
        ],
        "schematics" = [{
          endpointType = "public"
          zone_ids     = [module.cbr_zone_operator_ips.zone_id]
        }],
        "databases-for-postgresql" = [{
          endpointType = "private"
          ## Give access to the zone containing the VPC passed in zone_vpc_crn_list input
          add_managed_vpc_zone = true
        }]
      }
    ```
    and from working branch there is little change in `custom_rule_contexts_by_service` where var.kms = kms, it is detecting a change.
    
        
          custom_rule_contexts_by_service = merge({
            for key in var.kms : key => [{
              endpointType      = "public"
              service_ref_names = ["schematics"]
              },
              {
                endpointType = "public"
              zone_ids = [module.cbr_zone_operator_ips.zone_id] }
            ] }, {
            "schematics" = [{
              endpointType = "public"
              zone_ids     = [module.cbr_zone_operator_ips.zone_id]
            }],
            "databases-for-postgresql" = [{
              endpointType = "private"
              ## Give access to the zone containing the VPC passed in zone_vpc_crn_list input
              add_managed_vpc_zone = true
            }]
            }, {
            "kms" = [{
              endpointType      = "private"
              service_ref_names = ["messages-for-rabbitmq"]
              },
              {
                endpointType = "public"
              zone_ids = [module.cbr_zone_operator_ips.zone_id] }
          ] })
        
- To test this change in the FScloud example, I did apply on the `main` branch but copied the `custom_rule_contexts_by_service` as below from working branch and did the second TF apply, there I could see it was only creating one rule for HPCS with deny all only.
```
       custom_rule_contexts_by_service = {
    "kms" = [{
      endpointType      = "public"
      service_ref_names = ["schematics"]
      },
      {
        endpointType = "public"
      zone_ids = [module.cbr_zone_operator_ips.zone_id] }
    ],
    "schematics" = [{
      endpointType = "public"
      zone_ids     = [module.cbr_zone_operator_ips.zone_id]
    }],
    "databases-for-postgresql" = [{
      endpointType = "private"
      ## Give access to the zone containing the VPC passed in zone_vpc_crn_list input
      add_managed_vpc_zone = true
    }],
    "kms" = [{
      endpointType      = "private"
      service_ref_names = ["messages-for-rabbitmq"]
      },
      {
        endpointType = "public"
      zone_ids = [module.cbr_zone_operator_ips.zone_id] }
  ] }
```
```
  Terraform will perform the following actions:

  # module.cbr_account_level.module.cbr_rule["hs-crypto"].ibm_cbr_rule.cbr_rule will be created
  + resource "ibm_cbr_rule" "cbr_rule" {
      + created_at          = (known after apply)
      + created_by_id       = (known after apply)
      + crn                 = (known after apply)
      + description         = "fs-03-hs-crypto-rule"
      + enforcement_mode    = "report"
      + href                = (known after apply)
      + id                  = (known after apply)
      + last_modified_at    = (known after apply)
      + last_modified_by_id = (known after apply)
      + version             = (known after apply)

      + contexts {
          + attributes {
              + name  = "endpointType"
              + value = "public"
            }
          + attributes {
              + name  = "networkZoneId"
              + value = "afe33d0061b6cea2c2e6f54311210501"
            }
        }

      + operations {
          + api_types {
              + api_type_id = "crn:v1:bluemix:public:context-based-restrictions::::api-type:"
            }
        }

      + resources {
          + attributes {
              + name     = "accountId"
              + operator = "stringEquals"
              + value    = "abac0df06b644a9cabc6e44f55b3880e"
            }
          + attributes {
              + name     = "serviceName"
              + operator = "stringEquals"
              + value    = "hs-crypto"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ map_target_service_rule_ids     = {
      + hs-crypto                   = {
          + rule_id = (known after apply)
        }
        # (28 unchanged attributes hidden)
    }
```
  - Verified from the UI as well-
     
     <img width="320" alt="image" src="https://github.com/terraform-ibm-modules/terraform-ibm-cbr/assets/4889052/0158db1b-053e-4286-aa05-861690b77cb9">
